In [43]:
#Import libraries
#import neccessary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns


from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix
from sklearn.feature_selection import RFE
from sklearn.metrics import roc_curve, auc
from sklearn.preprocessing import label_binarize
from sklearn.multiclass import OneVsRestClassifier
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import roc_auc_score

In [44]:
df = pd.read_csv(r"C:\Users\hp\Desktop\final loan dataset\DSC-CapstoneProject-2\Data\Final_Loans_dataset.csv")
df.head()

,ID,GENDER,AGE,NO_DEFAULT_LOAN,EMPLOYMENT_STATUS,SECTOR,MARITAL_STATUS,CREDIT_SCORE,SCOREGRADE,CRR,CURRENCY,NET INCOME,PRINCIPAL_AMOUNT,EMI,OD_DAYS,PRUDENTIAL_CLASSIFICATION,RISK_GRADE,AREARS,LOAN_STATUS
0,209801.0,FEMALE,37.0,7.0,EMPLOYED,FINANCE & INSURANCE,MARRIED,615.0,II,B10,KES,5000.00,642000.00,"59,826.37",204.0,DOUBTFUL,B9,"453,208.12",CURRENT
1,315048.0,MALE,41.0,3.0,SELF-EMPLOYED,NaN,MARRIED,529.0,JJ,B20,KES,0.00,78000.00,"6,149.03",295.0,DOUBTFUL,B9,"68,917.29",EXPIRED
2,145878.0,MALE,36.0,6.0,EMPLOYED,TRANSPORT & COMMUNICATION,MARRIED,665.0,FF,A5,KES,1294783.78,80000.00,"7,439.02",0.0,NORMAL,A1-A6,4.84,CURRENT
3,295535.0,MALE,41.0,5.0,EMPLOYED,NaN,0,618.0,HH,B20,KES,347554.00,172000.00,"16,062.90",323.0,DOUBTFUL,B9,"195,045.53",EXPIRED
4,493960.0,MALE,41.0,1.0,EMPLOYED,FINANCE & INSURANCE,SINGLE,696.0,DD,A5,KES,4210957.00,300502.44,"28,098.61",0.0,NORMAL,A1-A6,247.18,CURRENT

In [54]:
df.columns

Index(['ID', 'GENDER', 'AGE', 'NO_DEFAULT_LOAN', 'EMPLOYMENT_STATUS', 'SECTOR',
       'MARITAL_STATUS', 'CREDIT_SCORE', 'SCOREGRADE', 'CRR', 'CURRENCY',
       'NET INCOME', 'PRINCIPAL_AMOUNT', 'EMI', 'OD_DAYS',
       'PRUDENTIAL_CLASSIFICATION', 'RISK_GRADE', 'AREARS', 'LOAN_STATUS'],
      dtype='object')

In [55]:
df.describe()

,ID,AGE,NO_DEFAULT_LOAN,CREDIT_SCORE,NET INCOME,PRINCIPAL_AMOUNT,OD_DAYS
count,18196.000000,18109.000000,17921.000000,17921.000000,1.776200e+04,1.819600e+04,18196.000000
mean,253791.005496,38.239273,1.045143,668.165225,2.770445e+06,1.985309e+05,9.487635
std,142330.186635,15.259873,1.593557,73.685554,5.592813e+06,2.508291e+05,38.745497
min,10010.000000,-1595.000000,0.000000,0.000000,0.000000e+00,1.000000e+03,0.000000
25%,128677.000000,31.000000,0.000000,618.000000,4.262687e+05,1.800000e+04,0.000000
50%,253241.000000,37.000000,0.000000,665.000000,1.123309e+06,1.000000e+05,0.000000
75%,376761.250000,44.000000,2.000000,720.000000,2.820720e+06,2.805882e+05,0.000000
max,499999.000000,93.000000,15.000000,830.000000,1.338524e+08,1.445752e+06,323.000000

In [45]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18196 entries, 0 to 18195
Data columns (total 19 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   ID                         18196 non-null  float64
 1   GENDER                     17748 non-null  object
 2   AGE                        18109 non-null  float64
 3   NO_DEFAULT_LOAN            17921 non-null  float64
 4   EMPLOYMENT_STATUS          18196 non-null  object
 5   SECTOR                     18069 non-null  object
 6   MARITAL_STATUS             18196 non-null  object
 7   CREDIT_SCORE               17921 non-null  float64
 8   SCOREGRADE                 17921 non-null  object
 9   CRR                        18196 non-null  object
 10  CURRENCY                   18196 non-null  object
 11  NET INCOME                 17762 non-null  float64
 12  PRINCIPAL_AMOUNT           18196 non-null  float64
 13  EMI                        18196 non-null  object
 14  OD_DAYS                    18196 non-null  float64
 15  PRUDENTIAL_CLASSIFICATION  18196 non-null  object
 16  RISK_GRADE                 18196 non-null  object
 17  AREARS                     18196 non-null  object
 18  LOAN_STATUS                18196 non-null  object
dtypes: float64(7), object(12)
memory usage: 2.6+ MB
None

In [46]:
# Check the number of rows to confirm
print("Total rows before cleaning:", df.shape[0])

Total rows before cleaning: 18196

In [47]:
print(df.isnull().sum())

ID                             0
GENDER                       448
AGE                           87
NO_DEFAULT_LOAN              275
EMPLOYMENT_STATUS              0
SECTOR                       127
MARITAL_STATUS                 0
CREDIT_SCORE                 275
SCOREGRADE                   275
CRR                            0
CURRENCY                       0
NET INCOME                   434
PRINCIPAL_AMOUNT               0
EMI                            0
OD_DAYS                        0
PRUDENTIAL_CLASSIFICATION      0
RISK_GRADE                     0
AREARS                         0
LOAN_STATUS                    0
dtype: int64

In [48]:
# Keep only the first 18,196 rows
df_1= df.head(18196)

# Check the shape of the cleaned dataset
print("Rows after cleaning:", df_cleaned.shape[0])
df_1.to_csv(r"C:\Users\hp\Desktop\final loan dataset\DSC-CapstoneProject-2\Data\Final_Loans_dataset.csv", index=False)

Rows after cleaning: 18196

In [49]:
print(df_1.isnull().sum())

ID                             0
GENDER                       448
AGE                           87
NO_DEFAULT_LOAN              275
EMPLOYMENT_STATUS              0
SECTOR                       127
MARITAL_STATUS                 0
CREDIT_SCORE                 275
SCOREGRADE                   275
CRR                            0
CURRENCY                       0
NET INCOME                   434
PRINCIPAL_AMOUNT               0
EMI                            0
OD_DAYS                        0
PRUDENTIAL_CLASSIFICATION      0
RISK_GRADE                     0
AREARS                         0
LOAN_STATUS                    0
dtype: int64

In [58]:
df_1= df_1.dropna(subset=["CREDIT_SCORE"])
df_1= df_1.dropna(subset=["NET INCOME"])
df_1= df_1.dropna(subset=["GENDER"])
df_1= df_1.dropna(subset=["SECTOR"])

In [59]:
df_1.isnull().sum()

ID                            0
GENDER                        0
AGE                          40
NO_DEFAULT_LOAN               0
EMPLOYMENT_STATUS             0
SECTOR                        0
MARITAL_STATUS                0
CREDIT_SCORE                  0
SCOREGRADE                    0
CRR                           0
CURRENCY                      0
NET INCOME                    0
PRINCIPAL_AMOUNT              0
EMI                           0
OD_DAYS                       0
PRUDENTIAL_CLASSIFICATION     0
RISK_GRADE                    0
AREARS                        0
LOAN_STATUS                   0
dtype: int64

In [60]:

# Handle missing values by filling with column mean (or you could drop rows)
df_1['AGE'].fillna(df_1['AGE'].mean(), inplace=True)

# Finally, check the cleaned dataframe
print(df_1.head())

         ID  GENDER   AGE  NO_DEFAULT_LOAN EMPLOYMENT_STATUS  \
0  209801.0  FEMALE  37.0              7.0          EMPLOYED
2  145878.0    MALE  36.0              6.0          EMPLOYED
4  493960.0    MALE  41.0              1.0          EMPLOYED
6  280570.0  FEMALE  38.0              0.0          EMPLOYED
7   45325.0  FEMALE  32.0              0.0          EMPLOYED

                                SECTOR MARITAL_STATUS  CREDIT_SCORE  \
0                  FINANCE & INSURANCE        MARRIED         615.0
2            TRANSPORT & COMMUNICATION        MARRIED         665.0
4                  FINANCE & INSURANCE         SINGLE         696.0
6                  FINANCE & INSURANCE         SINGLE         632.0
7  SOCIAL, COMMUNITY & PERSONAL SERVIC        MARRIED         622.0

  SCOREGRADE  CRR CURRENCY  NET INCOME  PRINCIPAL_AMOUNT       EMI  OD_DAYS  \
0         II  B10      KES     5000.00         642000.00  59826.37    204.0
2         FF   A5      KES  1294783.78          80000.00   7439.02      0.0
4         DD   A5      KES  4210957.00         300502.44  28098.61      0.0
6         HH   B9      KES    44280.00          82000.72   6802.81    111.0
7         HH   A5      KES  1000139.59         339584.95  15279.32     19.0

  PRUDENTIAL_CLASSIFICATION RISK_GRADE     AREARS LOAN_STATUS
0                  DOUBTFUL         B9  453208.12     CURRENT
2                    NORMAL      A1-A6       4.84     CURRENT
4                    NORMAL      A1-A6     247.18     CURRENT
6               SUBSTANDARD         B8   26582.90     CURRENT
7                    NORMAL      A1-A6   15519.98     CURRENT

C:\Users\hp\AppData\Local\Temp\ipykernel_25076\2986622001.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_1['AGE'].fillna(df_1['AGE'].mean(), inplace=True)

In [61]:
df_1.isnull().sum()

ID                           0
GENDER                       0
AGE                          0
NO_DEFAULT_LOAN              0
EMPLOYMENT_STATUS            0
SECTOR                       0
MARITAL_STATUS               0
CREDIT_SCORE                 0
SCOREGRADE                   0
CRR                          0
CURRENCY                     0
NET INCOME                   0
PRINCIPAL_AMOUNT             0
EMI                          0
OD_DAYS                      0
PRUDENTIAL_CLASSIFICATION    0
RISK_GRADE                   0
AREARS                       0
LOAN_STATUS                  0
dtype: int64

In [50]:
# Show the data types of all columns
df_1.dtypes

ID                           float64
GENDER                        object
AGE                          float64
NO_DEFAULT_LOAN              float64
EMPLOYMENT_STATUS             object
SECTOR                        object
MARITAL_STATUS                object
CREDIT_SCORE                 float64
SCOREGRADE                    object
CRR                           object
CURRENCY                      object
NET INCOME                   float64
PRINCIPAL_AMOUNT             float64
EMI                           object
OD_DAYS                      float64
PRUDENTIAL_CLASSIFICATION     object
RISK_GRADE                    object
AREARS                        object
LOAN_STATUS                   object
dtype: object

In [51]:
# Use .loc to ensure you are modifying the original DataFrame
df_1.loc[:, 'AGE'] = pd.to_numeric(df_1['AGE'], errors='coerce')
df_1.loc[:, 'PRINCIPAL_AMOUNT'] = pd.to_numeric(df_1['PRINCIPAL_AMOUNT'], errors='coerce')

In [52]:
df_1.dtypes

ID                           float64
GENDER                        object
AGE                          float64
NO_DEFAULT_LOAN              float64
EMPLOYMENT_STATUS             object
SECTOR                        object
MARITAL_STATUS                object
CREDIT_SCORE                 float64
SCOREGRADE                    object
CRR                           object
CURRENCY                      object
NET INCOME                   float64
PRINCIPAL_AMOUNT             float64
EMI                           object
OD_DAYS                      float64
PRUDENTIAL_CLASSIFICATION     object
RISK_GRADE                    object
AREARS                        object
LOAN_STATUS                   object
dtype: object

In [56]:
df_1["EMI"] = df_1["EMI"].str.replace(",", "").astype(float)
df_1["AREARS"] = df_1["AREARS"].str.replace(",", "").astype(float)

In [57]:
df_1.dtypes

ID                           float64
GENDER                        object
AGE                          float64
NO_DEFAULT_LOAN              float64
EMPLOYMENT_STATUS             object
SECTOR                        object
MARITAL_STATUS                object
CREDIT_SCORE                 float64
SCOREGRADE                    object
CRR                           object
CURRENCY                      object
NET INCOME                   float64
PRINCIPAL_AMOUNT             float64
EMI                          float64
OD_DAYS                      float64
PRUDENTIAL_CLASSIFICATION     object
RISK_GRADE                    object
AREARS                       float64
LOAN_STATUS                   object
dtype: object

In [63]:
df_1.duplicated().sum()

0